ide.org
* Literate Programming
I love Donald Knuth's style of programming.

Org babel quick tutorial by howard abrahms: https://gist.github.com/Profpatsch/abda97a7b635f876e29f544a26840666

** expand :noweb references by default on tangle & eval, but not on export
In other words, =C-c C-c= should comprehend the code refered as =\<\<Some Other Block\>\>=
Because on say, pdf export, I want to retain =\<\<Some Other Block\>\>=  in unexpanded form for readability
#+begin_src emacs-lisp :tangle ide.el
(setq org-babel-default-header-args
      (cons '(:noweb . "no-export")
            (assq-delete-all :noweb org-babel-default-header-args)))
#+end_src
** disable noweb-prefix
Do not repeat the text before ~<some target>~ when expanding named source blocks.

The below setting will achieve the above feature.
#+begin_src emacs-lisp
(setq org-babel-default-header-args
      (cons '(:noweb-prefix . "no") org-babel-default-header-args))
#+end_src

But, I want to achieve the above feature before emacs reads this orgfile. Because, this orgfile too makes use of above no-repeat feature.
File local variables are set before a file is read. Therefore, if above is set as a file local variable, then it will be set before this orgfile is read.

Therefore, I am setting the above code as a file local variable in the current file.

To achieve this, I need to add the above line to the footer of this orgfile, so that it gets loaded *before* this file itself is tangled into new2.el
Hence, add this to the [[*File Settings][File Settings]] in the footer of this file.

** beautifully render richtext
/italic/
*bold*
+strikethrough+
_underline_
~code~
=verbatim=
#+begin_src emacs-lisp :tangle ide.el
(setq org-hide-emphasis-markers t)
#+end_src

Define a symbol for denoting end of a paragraph?
#+begin_src emacs-lisp :tangle ide.el
;;(global-set-key (kbd "C-c y") (lambda () (interactive) (insert "§")))
#+end_src

** Hide '*' symbols in org headings
Have switched to ~org-hide-leading-stars~ because org-bullets sometimes severely slows down emacs orgmode
#+begin_src emacs-lisp :tangle ide.el
;;(setq org-bullets-bullet-list '(" "))
#+end_src
^Note that this slightly confuses org-variable-pitch
This causes the harmless warning: 
#+begin_quote
‘org-indent’ is not a valid face, thus OVP skipped it
#+end_quote

The simpler builtin solution is ~org-hide-leading-stars~
But, it leaves the last star visible. I dislike this.
#+begin_src emacs-lisp
(setq org-hide-leading-stars t)
#+end_src
Hence, let me try a dedicated package that hides the stars
#+begin_src emacs-lisp :tangle ide.el
(use-package org-starless
  :vc (:url "https://github.com/TonCherAmi/org-starless")
  :config
  (add-hook 'org-mode-hook #'org-starless-mode))
#+end_src

Because, whenever unhidden, I would love to see how many stars are there. This happens momentarily when org heading is still empty.
#+begin_src emacs-lisp :noweb-ref "orgmode/custom"
(org-hide-leading-stars nil)
#+end_src


Below is no longer needed as I have started using org-indent-mode.
This solution isnt water_leaky0 🙂
ie, water can leak from the /contents/ out of the /heading/ which causes me tension.
I need to fix this by getting rid of the leading space character.
#+begin_src emacs-lisp :tangle ide.el
;;(defun org-bullets-level-char (level)
;;  "Always return ''"
;;  (string-to-char ""))
#+end_src
^doesnt work, causes bugs

? ~org-hide-emphasis-markers~


** Hide all code
A true literate programmer's prose is good enough to understand the flow of the program.
Moreover, I would have written the prose of hard to understand sections twice.
Once in a formal manner and once more in a casual manner, as suggested by Knuth.

*** COMMENT Therefore, safely hide all src blocks on opening an org file
^disabled because on migrating from emacs-29 to emacs-30-igc, I started getting a bug while opening job.org file.
#+begin_src emacs-lisp :hidden :tangle ide.el
(setq org-hide-block-startup t)
#+end_src

*** Also, hide drawers such as ~#+RESULTS~.
This is especially convenient because some of such results drawers are very very long.
#+begin_src emacs-lisp :hidden :tangle ide.el
(setq org-hide-drawer-startup t)
#+end_src
** Customize colors and font of org headings
#+begin_src emacs-lisp :noweb-ref "Leuven config"
(set-face-attribute 'org-level-1 nil
                    :family "Arcanite Slab"
                    :height 1.3
                    :background "misty rose"
                    :foreground "red3"
                    :weight 'normal
                    :overline t)
(set-face-attribute 'org-level-2 nil
                    :family "Arcanite Slab"
                    :height 1.2
                    :weight 'normal
                    :overline t)
(set-face-attribute 'org-level-3 nil
                    :family "Arcanite Slab"
                    :height 1.1
                    :weight 'normal
                    :overline t)
(set-face-attribute 'org-level-4 nil
                    :family "Arcanite Slab"
                    :foreground "red3"
                    :weight 'normal
                    :overline t)
(set-face-attribute 'org-level-5 nil
                    :family "Arcanite Slab"
                    :foreground "blue4"
                    :weight 'normal
                    :overline t)
(set-face-attribute 'org-level-6 nil
                    :family "Arcanite Slab"
                    :foreground "green4"
                    :weight 'normal
                    :slant 'normal
                    :overline t)
#+end_src
** COMMENT wrapped lines need to be indented properly
Keep all of the wrapped lines with the parent's indentation
#+begin_src emacs-lisp
(use-package adaptive-wrap
  :config
  (add-hook 'org-mode-hook 'turn-on-visual-line-mode))
#+end_src
** orgmode startup what all to show
Show me all things unfolded except the /PROPERTIES/
#+begin_src emacs-lisp :tangle ide.el
(setq org-startup-folded "nofold")
#+end_src
** Org variable pitch
Wisely auto switches to monospace fonts over checkboxes, headline bullets etc to make them align vertically

+I am using serif font =Alegreya= for prose. This font needs to be installed using =yay=+
Trying out the /Atkinson Hyperlegible/ font family from braille institute. Installed using =yay=
#+begin_src emacs-lisp :tangle ide.el
(use-package org-variable-pitch
  :hook (org-mode . org-variable-pitch-minor-mode)
  ;;:config
  ;;(set-face-attribute 'fixed-pitch nil :family "Iosevka")
  ;;(set-face-attribute 'variable-pitch nil :family "Alegreya")
  ;;(set-face-attribute 'variable-pitch nil :family "Atkinson Hyperlegible")
  )
#+end_src
Test case:- (Do these 3 checkboxes line up in org mode?)
- [ ] Unfinished
- [X] Done
- [-] Canceled
** Org Babel Src blocks theme customize
*** Display hex colors codes in emacs lisp buffers
This helps greatly when studying & customising some inbuilt color theme
#+begin_src emacs-lisp :tangle ide.el
(use-package rainbow-mode
  :if window-system
  :hook (emacs-lisp-mode . rainbow-mode)
  :config
  (defalias 'show-css-colors-mode0 'rainbow-mode))
#+end_src

*** begin_src ,end_src & src block background theming
I am assuming that leuven is the base theme activated for org mode

Leuven by default provides a yellowish background to src blocks. I prefer github like light grey
I have set src-block background to be 4% darker than the default background of the org buffer as per theme

Leuven  =begin_src= and =end_src= are too eye popping for my taste
I prefer to subdue the block starting line & hide the block ending line

If you would like to temperorily unhide or un-subdue these, just use hl-line-mode or select that text to obtain a
blue background. Or, you can edit and re-eval below block temperorily
#+begin_src emacs-lisp :noweb-ref "org-faces/config/Define custom faces for org block"
(require 'color)
(let ((background-9%-darkened (color-darken-name (face-attribute 'default :background) 3))
          (background-15%-darkened (color-darken-name (face-attribute 'default :background) 9))
          (background-40%-darkened (color-darken-name (face-attribute 'default :background) 40)))
      ;;^the color obtained by darkening the background by 9% is called background-9%-darkened
      
      (set-face-attribute 'org-block-begin-line nil
                          :foreground background-40%-darkened
                          :background background-9%-darkened
                          :underline nil)
      (set-face-attribute 'org-block-end-line nil
                          :foreground background-15%-darkened
                          :background background-9%-darkened
                          :overline nil)
      (set-face-attribute 'org-block nil
                          :background background-9%-darkened))
#+end_src
*** COMMENT Replace begin_src python with =¶=
TODO: Make this even prettier by installing nerdfonts
Ⓟ means this block is not tangled
Ⓕ means this block is tangled to a file
#+begin_src emacs-lisp :tangle ide.el
(setq-default prettify-symbols-alist '(("#+begin_src python :results output" . "¶")
                                       ("#+begin_src python :noweb-ref" . "Ⓟ")
                                       ("#+begin_src python :comments link" . "Ⓕ")
                                       ;;(":tangle" . "→")
				       ))
#+end_src

*** PROPERTIES green color is too bright, make it subdued
I chose grey foreground & white background

Place your cursor inside a :PROPERTIES: block and press C-u C-x =. This should give
you info on why Emacs displays the char at point the way it does.
Likely culprit is the face attribute of  =org-special-keyword=

=org-drawer= is kinda like a superclass that includes everything around =org-speical-keyword= block
So, I am setting its color code

I have chosen its background to be white & its foreground to be 4% darker than canvas background
#+begin_src emacs-lisp :noweb-ref "org-faces/config/Define custom faces for org PROPERTIES"
(let ((background-15%-darkened (color-darken-name (face-attribute 'default :background) 15)))
      (set-face-attribute 'org-special-keyword nil 
                          :foreground background-15%-darkened 
                          :background "#FFFFFF")
      (set-face-attribute 'org-drawer nil 
                          :foreground background-15%-darkened 
                          :background "#FFFFFF")
      (set-face-attribute 'org-property-value nil 
                          :foreground background-15%-darkened 
                          :background "#FFFFFF"))
#+end_src
*** Make cursor stand out a bit more
By default it has a light blue color that doesnt pop out much
Make it so that this applies to all future frames and becomes a default frame property
#+begin_src emacs-lisp :tangle ide.el
;;(add-to-list 'default-frame-alist '(cursor-color . "light coral"))
;;(add-to-list 'default-frame-alist '(cursor-color . "yellow"))
;;(add-to-list 'default-frame-alist '(cursor-color . "black"))
(add-to-list 'default-frame-alist '(cursor-color . "red"))
;;(set-cursor-color "black")
#+end_src
*** end_src grey out whole line
But this looks kinda ugly when org headings are closed
#+begin_src emacs-lisp :tangle ide.el
(setq org-fontify-whole-block-delimiter-line t)
#+end_src
*** Color the entire width of the headling line   
Theme the whole line when the heading is in open mode
This makes the heading of any src block visually more explicit, when that heading is open
#+begin_src emacs-lisp :tangle ide.el
(setq org-fontify-whole-heading-line t)
#+end_src
** COMMENT org src block color bleeding bugfix
*** CANCELLED COMMENT Solution =1= buggy, I have stolen this from stackoverflow
Copy & pasted without understanding. Seems to work for me though.
https://emacs.stackexchange.com/questions/52324/prevent-org-source-block-face-from-bleeding-out-in-fold
#+begin_src emacs-lisp :tangle ide.el
(defun org-fix-bleed-end-line-block (from to flag spec)
  "Toggle fontification of last char of block end lines when cycling.
       This avoids the bleeding of `org-block-end-line' when block is
       folded."
  (when (and (eq spec 'org-hide-block)
             (/= (point-max) to))
    (save-excursion
      (if flag
          (font-lock-unfontify-region to (1+ to))
        (font-lock-flush to (1+ to))))))

(advice-add 'org-flag-region :after #'org-fix-bleed-end-line-block)

(defun org-fix-bleed-end-line-cycle (state)
  "Toggle fontification of last char of block lines when cycling.
       This avoids the bleeding of `org-block-end-line' when outline
       is folded."
  (save-excursion
    (when org-fontify-whole-block-delimiter-line
      (let ((case-fold-search t)
            beg end)
        (cond ((memq state '(overview contents all))
               (setq beg (point-min)
                     end (point-max)))
              ((memq state '(children folded subtree))
               (setq beg (point)
                     end (org-end-of-subtree t t))))
        (when beg           ; should always be true, but haven't tested enough
          (goto-char beg)
          (while (search-forward "#+end" end t)
            (end-of-line)
            (unless (= (point) (point-max))
              (if (org-invisible-p (1- (point)))
                  (font-lock-unfontify-region (point) (1+ (point)))
                (font-lock-flush (point) (1+ (point)))))))))))

(add-hook 'org-cycle-hook #'org-fix-bleed-end-line-cycle)
#+end_src

