ide.el
(setq org-babel-default-header-args
      (cons '(:noweb . "no-export")
            (assq-delete-all :noweb org-babel-default-header-args)))

(setq org-hide-emphasis-markers t)

;;(global-set-key (kbd "C-c y") (lambda () (interactive) (insert "ยง")))

;;(setq org-bullets-bullet-list '(" "))

(use-package org-starless
  :vc (:url "https://github.com/TonCherAmi/org-starless")
  :config
  (add-hook 'org-mode-hook #'org-starless-mode))

;;(defun org-bullets-level-char (level)
;;  "Always return ''"
;;  (string-to-char ""))

(setq org-hide-drawer-startup t)

(setq org-startup-folded "nofold")

(use-package org-variable-pitch
  :hook (org-mode . org-variable-pitch-minor-mode)
  ;;:config
  ;;(set-face-attribute 'fixed-pitch nil :family "Iosevka")
  ;;(set-face-attribute 'variable-pitch nil :family "Alegreya")
  ;;(set-face-attribute 'variable-pitch nil :family "Atkinson Hyperlegible")
  )

(use-package rainbow-mode
  :if window-system
  :hook (emacs-lisp-mode . rainbow-mode)
  :config
  (defalias 'show-css-colors-mode0 'rainbow-mode))

;;(add-to-list 'default-frame-alist '(cursor-color . "light coral"))
;;(add-to-list 'default-frame-alist '(cursor-color . "yellow"))
;;(add-to-list 'default-frame-alist '(cursor-color . "black"))
(add-to-list 'default-frame-alist '(cursor-color . "red"))
;;(set-cursor-color "black")

(setq org-fontify-whole-block-delimiter-line t)

(setq org-fontify-whole-heading-line t)
