ide.org
*** CANCELLED COMMENT Solution =2= also buggy, [[https://old.reddit.com/r/emacs/comments/cw0499/prevent_folded_headings_from_bleeding_out/][reddit ]]
unfontify end_src whenever fold is called
#+begin_src emacs-lisp :tangle ide.el
(defun dwim-unfontify-last-line-of-subtree (&rest _)
  "Unfontify last line of subtree if it's a source block."
  (save-excursion
    (org-end-of-subtree)
    (beginning-of-line)
    (when (looking-at-p (rx "#+end_src"))
      (font-lock-unfontify-region
       (line-end-position) (1+ (line-end-position))))))

(advice-add #'outline-hide-subtree :after #'dwim-unfontify-last-line-of-subtree)
#+end_src

#+begin_src emacs-lisp :tangle ide.el
(defun dwim-fontify-last-line-of-block (&rest _)
  "Do what I mean: fontify last line of source block.
     When the heading has a source block as the last item (in the subtree) do the
       following:
     If the source block is now visible, fontify the end its last line.
     If it's still invisible, unfontify its last line."
  (let (font-lock-fn point)
    (save-excursion
      (org-end-of-subtree)
      (beginning-of-line)
      (run-hooks 'outline-view-change-hook)
      (when (looking-at-p (rx "#+end_src"))
        (setq font-lock-fn
              (if (invisible-p (line-end-position))
                  #'font-lock-unfontify-region
                #'font-lock-fontify-region))
        (funcall font-lock-fn
                 (line-end-position)
                 (1+ (line-end-position)))))))

(advice-add #'outline-show-heading :after #'dwim-fontify-last-line-of-block)
#+end_src
*** CANCELLED COMMENT Solution =3= my own attempt
unfontify end_src whenever fold is called
but hook as per solution =1=
#+begin_src emacs-lisp :tangle ide.el
(defun dwim-unfontify-last-line-of-subtree (&rest _)
  "Unfontify last line of subtree if it's a source block."
  (print "un-fontify  ZZZZZZZZZZZZZ")
  (save-excursion
    (org-end-of-subtree)
    (beginning-of-line)
    (when (looking-at-p (rx "#+end_src"))
      (font-lock-unfontify-region
       (line-end-position) (1+ (line-end-position))))))

(advice-add #'outline-hide-subtree :after #'dwim-unfontify-last-line-of-subtree)
#+end_src

#+begin_src emacs-lisp :tangle ide.el
(defun dwim-fontify-last-line-of-block (&rest _)
  "Do what I mean: fontify last line of source block.
     When the heading has a source block as the last item (in the subtree) do the
       following:
     If the source block is now visible, fontify the end its last line.
     If it's still invisible, unfontify its last line."
  (print "syntax highlight again ZZZZZZZZZZZZZZZZZZZ")
  (let (font-lock-fn point)
    (save-excursion
      (org-end-of-subtree)
      (beginning-of-line)
      (run-hooks 'outline-view-change-hook)
      (when (looking-at-p (rx "#+end_src"))
        (setq font-lock-fn
              (if (invisible-p (line-end-position))
                  #'font-lock-unfontify-region
                #'font-lock-fontify-region))
        (funcall font-lock-fn
                 (line-end-position)
                 (1+ (line-end-position)))))))

(advice-add #'outline-show-heading :after #'dwim-fontify-last-line-of-block)
#+end_src
*** CANCELLED COMMENT debug by printing state to messages
#+begin_src emacs-lisp :tangle ide.el
(defun temp_log_state0 (state)
  ;;(print "Cycle State0 in hook:-")
  (print state))
(add-hook 'org-cycle-hook #'temp_log_state0)
#+end_src

*** COMMENT A simpler hacky solution
Just set the bleed color to white.
Have disabled it for now because it makes it difficult to notice the #+end_src line
#+begin_src emacs-lisp :tangle ide.el
(set-face-attribute 'org-block-end-line nil :background "#")
#+end_src

** CANCELLED org-tanglesync v/s org-babel-detangle
syncs external tangled code back to org source
Also see if it is any better than the builtin =(org-babel-detangle &optional SOURCE-CODE-FILE)=
** COMMENT dont auto remove leading white spaces from codeblocks
Preserve leading whitespace characters on export or entering =C-c '=
+I think this feature might help in ensuring that git diff doesnt contain changes unnecessary garbage+
+I think, this also might help with sexp split across multiple src blocks+
#+begin_src emacs-lisp :tangle ide.el
(setq org-src-preserve-indentation t)
#+end_src
** COMMENT +org internal linking using+
#+begin_src emacs-lisp :tangle ide.el
(use-package helm-org-ql
  :quelpa (helm-org-ql :fetcher github :repo "alphapapa/org-ql"
                       :files ("helm-org-ql.el")))

#+end_src
** COMMENT orgmode internal linking using kitchin's org-ref
This package loads ox-pandoc as a dependency. ox-pandoc takes 5 seconds to load.
Hence, have disabled this for now

Need to write my own function that does insert-literate-target0
#+begin_src emacs-lisp :tangle ide.el
(use-package org-ref
  :config
  ;;(setq org-ref-insert-label-function 'org-ref-insert-label-link)  
  (setq org-latex-prefer-user-labels t)

  ;; below is recommended by this package
  ;; but this leads to failure of Pygments
  ;; so retain my previous settings for 'org-latex-pdf-process that uses xelatex
  ;; (setq org-latex-pdf-process
  ;;     '("pdflatex -interaction nonstopmode -output-directory %o %f"
  ;;       "bibtex %b"
  ;;       "pdflatex -interaction nonstopmode -output-directory %o %f"
  ;;       "pdflatex -interaction nonstopmode -output-directory %o %f"))

  ;; (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
  (defalias 'insert-literate-target0 'org-ref-insert-label-link))
#+end_src

** DONE Look into =:comments noweb= begin_src header argument
It leaves a comment in the tangled file.
Those comments can be used to jump back to the org file from the tangled file.
There is an elisp function for such jumpback: ~org-babel-tangle-jump-to-org~

But one major drawback of such comments is that they might end up accidentally commenting any text following a noweb target.
Eg:-
<<bla bla>>;
The semicolon will be lost in the auto inserted comment:-
#ends_here;

Because of this drawback, I have decided to never use this header argument.
** org export - dont turn underscore into subscript
underscore & ^ should not be turned into subscript & superscript respectively
However, when the term is inside flower brackets, do interpret it as subscript & superscript
i.e. x^{y+z} should be interpreted as x superscript y+z inside the org export
#+begin_src emacs-lisp :tangle ide.el
(setq org-export-with-sub-superscripts '{})
#+end_src
** TODO COMMENT dont warn about duplicate label insertion
when I call literate0 insert label, dont pop up warn buffer

[[https://stackoverflow.com/questions/24779041/disable-warning-about-emacs-d-in-load-path]]
#+begin_src emacs-lisp
(defadvice display-warning
    (around no-warn-.emacs.d-in-load-path (type message &rest unused) activate)
  "Ignore the warning about the `.emacs.d' directory being in `load-path'."
  (unless (and (eq type 'initialization)
               (string-prefix-p "Your `load-path' seems to contain\nyour `.emacs.d' directory"
                                message t))
    ad-do-it))
#+end_src

**  =insert-literate-links0= link definitions <-> usages
\<\<bla \>\> is defined at line-numbers  =5=, =8=
<s :noweb-ref is used at is used at line-numbers =3= , =4=, =9=

(noweb-ref-goto-definitions ...)  bound to M-.
(noweb-ref-goto-usages ...) bound to M-,
Howard Abrams likes to use =M-?= for usages. Because =M-,= is used to go back.

(noweb-ref-goto ... call either of the above funcs intelligently based on cursor position)

auto insert definitions & usages as org-ql links below each source block
^this must be clickable even in exported pdfs

*** Linking
Jumping between src & org file: use =org-babel-tangle-jump-to-org=

How to link to ~:noweb-ref~ and ~< <Some Target> >~ :-
# All definitions
# [[file:::/:noweb-ref Collect all functions$/]]

# All targets
# [[file:::/^<<Collect all functions>>/]]


[[file:::3][This links to line number three in the same file]]
**** org ref
This code is used in section:- \[\[ref:Collect all functions\]\]
TODO: figure out how to export the  above clickable org-ref link into Latex

**** elisp 
*** COMMENT parse first attempt
#+begin_src emacs-lisp :tangle ide.el
(org-link-search "/^<<Collect all functions>>/")

(org-occur "/^<<Collect all functions>>/")

;; with callback
(org-occur "/^<<Collect all functions>>/"
           nil
           (lambda () (message (number-to-string (line-number-at-pos)))))

(occur "/^<<Collect all functions>>/")

(org-element-parse-buffer 'object)

;; all headlines
(org-element-map (org-element-parse-buffer) 'headline
  (lambda (o) (plist-get (cadr o) :raw-value)))

;; message prin1 src blocks
(org-element-map (org-element-parse-buffer) 'src-block
  (lambda (o)
    (message (prin1-to-string o))))
#+end_src

*** helper
#+begin_src emacs-lisp :tangle ide.el
;;helper
(defun pos-at-line-col0 (l c)
  (save-excursion
    (goto-char (point-min))
    (forward-line (- l 1))
    (move-to-column c)
    (point)))
;;(numberp (pos-at-line-col0 3 0))

;;(pos-at-line-col0 3 0)
#+end_src
*** COMMENT example map
#+begin_src emacs-lisp :tangle ide.el
(org-element-map (org-element-parse-buffer) 'src-block
  (lambda (o)
    (let* ((value0 (format "%s" (plist-get (cadr o) :value)))
           ;;(match0 (cl-search "\<\<Collect all functions\>\>" value0))
           (match1 (string-match "^\<\<Collect all functions\>\>" value0)))
      (if match1
          ;;(print line-number-where-match-occurs)
          ;;(print (numberp pos-where-src-body-begins))
          (let* (
                 (begin0 (plist-get (cadr o) :begin))
                 ;;(end0 (plist-get (cadr o) :end))
                 (begin_src-line-number (line-number-at-pos begin0))
                 ;;(end_src-line-number (line-number-at-pos end0))
                 (pos-where-src-body-begins (pos-at-line-col0 (+ begin_src-line-number 1) 0))
                 (pos-where-match-occurs (+ pos-where-src-body-begins match1))
                 (line-number-where-match-occurs (line-number-at-pos pos-where-match-occurs))
                 )
            ;;(print begin0);;correct
            ;;(print begin_src-line-number);;correct
            ;;(print pos-where-src-body-begins);;correct
            ;;(print pos-where-match-occurs)
            (print line-number-where-match-occurs)
            ;;(print "-----------")
            )))))
#+end_src

*** =find-matching-line-numbers=
#+begin_src emacs-lisp :tangle ide.el
(defun find-matching-line-numbers (regexp0)
  ;;(interactive)
  (org-element-map (org-element-parse-buffer) 'src-block
    (lambda (o)
      (let* ((value0 (format "%s" (plist-get (cadr o) :value)))
             ;;(match0 (cl-search "\<\<Collect all functions\>\>" value0))
             (match1 (string-match regexp0 value0)))
        (if match1
            ;;(print line-number-where-match-occurs)
            ;;(print (numberp pos-where-src-body-begins))
            (let* (
                   (begin0 (plist-get (cadr o) :begin))
                   ;;(end0 (plist-get (cadr o) :end))
                   (begin_src-line-number (line-number-at-pos begin0))
                   ;;(end_src-line-number (line-number-at-pos end0))
                   (pos-where-src-body-begins (pos-at-line-col0 (+ begin_src-line-number 1) 0))
                   (pos-where-match-occurs (+ pos-where-src-body-begins match1))
                   (line-number-where-match-occurs (line-number-at-pos pos-where-match-occurs))
                   )
              ;;(print begin0)
              ;;(print begin_src-line-number)
              ;;(print pos-where-src-body-begins)
              ;;(print pos-where-match-occurs)
              ;;(print line-number-where-match-occurs)
              (identity line-number-where-match-occurs) ;;add to the returned map
              ))))))
#+end_src
^Usage:- (find-matching-line-numbers "^< <Collect all functions> >")

