ide.el

(setq org-export-with-sub-superscripts '{})

;;helper
(defun pos-at-line-col0 (l c)
  (save-excursion
    (goto-char (point-min))
    (forward-line (- l 1))
    (move-to-column c)
    (point)))
;;(numberp (pos-at-line-col0 3 0))

;;(pos-at-line-col0 3 0)

(defun find-matching-line-numbers (regexp0)
  ;;(interactive)
  (org-element-map (org-element-parse-buffer) 'src-block
    (lambda (o)
      (let* ((value0 (format "%s" (plist-get (cadr o) :value)))
             ;;(match0 (cl-search "\<\<Collect all functions\>\>" value0))
             (match1 (string-match regexp0 value0)))
        (if match1
            ;;(print line-number-where-match-occurs)
            ;;(print (numberp pos-where-src-body-begins))
            (let* (
                   (begin0 (plist-get (cadr o) :begin))
                   ;;(end0 (plist-get (cadr o) :end))
                   (begin_src-line-number (line-number-at-pos begin0))
                   ;;(end_src-line-number (line-number-at-pos end0))
                   (pos-where-src-body-begins (pos-at-line-col0 (+ begin_src-line-number 1) 0))
                   (pos-where-match-occurs (+ pos-where-src-body-begins match1))
                   (line-number-where-match-occurs (line-number-at-pos pos-where-match-occurs))
                   )
              ;;(print begin0)
              ;;(print begin_src-line-number)
              ;;(print pos-where-src-body-begins)
              ;;(print pos-where-match-occurs)
              ;;(print line-number-where-match-occurs)
              (identity line-number-where-match-occurs) ;;add to the returned map
              ))))))
