ide.el

(setq ref-name-regex
      (rx ":noweb-ref "       ;begins with :noweb-ref
          (group (one-or-more (not (any ":")))) ;match until next param " :"  ;;DOUBT:- will there be a bug if there are no further " :" params?
          (zero-or-more ":" (one-or-more any)))) ;the rest of the parameters if any

(defun find-definitions ()
  ;;(interactive)
  ;;since all targets must have a definition, it suffices to just iterate over ref-names
  ;;i.e. ref-names is always a superset of target-names
  (find-all-ref-names-and-their-line-numbers))
;;returns: (("Collect all functions" (16 23)) ("The Main" (36)))

(defun find-ref-name-and-its-line-number (src-block0)
  (let ((parameters0 (format "%s" (plist-get (cadr src-block0) :parameters)))
        (begin0 (plist-get (cadr src-block0) :begin)))
    (when (string-match ref-name-regex parameters0)
      (let ((ref-name (s-trim-right (match-string 1 parameters0)))
            (ref-line-number (line-number-at-pos begin0)))
        (list ref-name ref-line-number)))))

(defun find-all-ref-names-and-their-line-numbers ()
  "Returns a list of all :noweb-ref ref-name0s in the current buffer, doesnt include duplicates"
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))
         (ref-names-with-line-number (org-element-map parsed-buffer 'src-block #'find-ref-name-and-its-line-number))
         (ref-names-deduplicated (find-all-ref-names))) ;defined elsewhere
    (mapcar (lambda (ref-name)
              (let* ((locations-for-ref-name (mapcar (lambda (tuple)
                                                       (if (string= (car tuple) ref-name)
                                                           (cadr tuple)))
                                                     ref-names-with-line-number)))
                (list ref-name (delq nil locations-for-ref-name))))
            ref-names-deduplicated)))

;;note: this also includes unused definitions
(defun find-usages ()
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))

        (definitions-that-are-actually-used-with-line-numbers
         (delete-dups
          (apply #'append
                 (org-element-map parsed-buffer 'src-block
                   'find-all-targets-and-their-line-numbers))))

        (ref-names (find-all-ref-names))
        (target-names (find-all-target-names))
        (ref-names-unused (set-difference ref-names target-names :test #'string=))
        (ref-names-unused-with-line-numbers (mapcar (lambda (ref-name) (list ref-name nil)) ref-names-unused)))
    
    (append definitions-that-are-actually-used-with-line-numbers
            ref-names-unused-with-line-numbers)))

;; ;;note: this doensnt include unused definitions
(defun find-all-targets-and-their-line-numbers (src-block0)
  (let ((value0 (format "%s" (plist-get (cadr src-block0) :value)))
        (pos 0)
        ret)
    (while (and (< pos (length value0)) (string-match org-target-regexp value0 pos))
      (setq pos (match-end 0)) ;;I must store this before calling any other function that may modify match data, such as my next line invocation of ~match-string~
      (let ((target-name (match-string 0 value0)))
        (setq topush (list (substring target-name 2 -2) (find-matching-line-numbers target-name)))
        (push topush ret)))
    ret))

(defun find-target-names (src-block0)
  "Returns a list of all the < <target-names> > in a given src-block0, includes duplicates"
  (let ((value0 (format "%s" (plist-get (cadr src-block0) :value)))
        (pos 0)
        target-names)
    (while (string-match org-target-regexp value0 pos) ;org-target-regexp is a builtin
      (push (substring (match-string 0 value0) 2 -2) target-names)
      (setq pos (match-end 0)))
    (reverse target-names)))

(defun find-all-target-names ()
  "Returns a list of all < <target-names> > in the current buffer, doesnt include duplicates"
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))
         (target-names (delete-duplicates (reduce #'append (org-element-map parsed-buffer 'src-block #'find-target-names)) :test #'string=)))
    target-names))

(defun delete-all-definitions ()
  ;;(interactive)
  (mapcar #'delete-one-definition (find-all-target-names)))

(defun delete-one-definition (target-name)
  ;;(interactive)
  ;;very dirty macro:- :( My first macro usage though :)
  (let ((regexp0 (eval `(rx line-start "\/" ,@target-name "\/" " is defined at"))))
    (beginning-of-buffer)               ;because delete lines works from point to end-of-file
    (delete-matching-lines regexp0)))

(defun find-ref-name (src-block0)
  "Returns the :noweb-ref ref-name0 for the given src-block0, if it exists"
  (let ((parameters0 (format "%s" (plist-get (cadr src-block0) :parameters))))
    (when (string-match ref-name-regex parameters0)
      (s-trim-right (match-string 1 parameters0)))))

(defun find-all-ref-names ()
  "Returns a list of all :noweb-ref ref-name0s in the current buffer, doesnt include duplicates"
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))
         (ref-names (delete-duplicates (org-element-map parsed-buffer 'src-block #'find-ref-name) :test #'string=)))
    ref-names))

(defun delete-all-usages ()
  ;;(interactive)
  (mapcar #'delete-one-usage (find-all-ref-names)))

(defun delete-one-usage (ref-name)
  ;;(interactive)
  ;;very dirty macro:- :( My first macro usage though :)
  (let ((regexp0 (eval `(rx line-start "\/" ,@ref-name "\/" " is used at"))))
    (beginning-of-buffer)               ;because delete lines works from point to end-of-file
    (delete-matching-lines regexp0)))
