ide.org
*** =insert-blank-usages=
#+begin_src emacs-lisp :tangle ide.el
;;Assume that buffer contains no definitions currently
;;TODO: LATER, SPECIAL CASE what happens when an src block contains both targets & also it itself defines something

(defun find-number-of-refs-for-each (src-block0)
  "Returns either 1 or 0"
  (let ((parameters0 (format "%s" (plist-get (cadr src-block0) :parameters))))
    (if (string-match ref-name-regex parameters0)
        1
      0)))

(defun blank-usages-location-for-each (src-block0)
  "Returns a list of line numbers where /Definitions/ need to be inserted for each src-block0
Misnomer: better to call it source block ending line number"
  (let* ((end0 (plist-get (cadr src-block0) :end))
         (end_src-line-number (line-number-at-pos end0)))
    (identity end_src-line-number)))

(defun insert-blank-usages ()
  "This enables us to not mess up line numbers when we run =find-definitions="
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))
         (number-of-refs (org-element-map parsed-buffer 'src-block #'find-number-of-refs-for-each))
         (usage-insert-locations (org-element-map parsed-buffer 'src-block #'blank-usages-location-for-each))
         (ref-names (org-element-map parsed-buffer 'src-block #'find-ref-name))
         (adjusted-tuple (adjust-line-numbers2 number-of-refs usage-insert-locations)))
    (insert-blank-usages-text adjusted-tuple ref-names)))

;;helpers:
;; same repeat function
(defun running-sum (lst)
  (cl-loop with sum = 0
        for x in lst
        collect (setf sum (+ sum x))))
(running-sum '(1 2 3 4))

(defun adjust-line-numbers2 (number-of-refs usage-insert-locations)
  "Adjust because inserting lines alters the line numbers from the original cached parsed buffer.
Returns a list of tuples of form (adjusted line number, number of blank definitions)"
  (setq lines-to-skip (cons 0 (running-sum number-of-refs)))
  (cl-mapcar (lambda (num line skip)
               (list (+ line skip) num))
             number-of-refs usage-insert-locations lines-to-skip))

(defun insert-blank-usages-text (list-of-tuples ref-names)
  "Tuple of form ((l1, n1), (l2, n2))
At line l1, insert n1 definitions for target-name t1"
  (mapcar (lambda (tuple)
            (if (/= (cadr tuple) 0)
              (insert-blanks-usages-text-helper (car tuple) (pop ref-names))))
          list-of-tuples))

(defun insert-blanks-usages-text-helper (line-number ref-name)
  "At line-number, insert blank usage for given ref-name"
  (goto-line line-number)
  (insert (format "/%s/ is used at (BLANK PLACEHOLDER)\n" ref-name)))
#+end_src

*** =insert-blank-definitions=
ASSUME that buffer already contains blank usages now
+NEED TO ACCOUNT FOR LINE NUMBER CHANGES DUE TO USAGES LINES+
Just assume that definition will be written at end_src line & a newline added
Therefore, implicitly the definition will push down on the already inserted usage

#+begin_src emacs-lisp :tangle ide.el
(defun find-number-of-targets-for-each (src-block0)
  "Returns the number of < <targets> > for given src-block0 as a list"
  (let ((value0 (format "%s" (plist-get (cadr src-block0) :value)))
         (pos 0)
         target-names)
    (while (string-match org-target-regexp value0 pos)
      (push (match-string 0 value0) target-names)
      (setq pos (match-end 0)))
    (length target-names)))

(defun blank-definitions-location-for-each (src-block0)
  "Returns a list of line numbers where /Definitions/ need to be inserted for each src-block0"
  (let* (
         ;;(N (find-number-of-targets-for-each src-block0))
        (end0 (plist-get (cadr src-block0) :end))
        (end_src-line-number (line-number-at-pos end0)))
    (identity end_src-line-number)))

;; (defun find-target-names-for-each (src-block0)
;;   "Returns a list of all the < <target-names> > in a given src-block0, includes duplicates
;; Return nil if no targets exist for the src-block0"
;;   (let ((value0 (format "%s" (plist-get (cadr src-block0) :value)))
;;         (pos 0)
;;         target-names)
;;     (while (string-match org-target-regexp value0 pos)
;;       (push (substring (match-string 0 value0) 2 -2) target-names)
;;       (setq pos (match-end 0)))
;;     (if (/= (length target-names) 0)
;;         (reverse target-names)
;;       (list nil)                        ;(nil) return indicates no target-names found
;;       )))

;; (defun find-all-targets (src-block0)
;;   (let ((value0 (format "%s" (plist-get (cadr src-block0) :value)))
;;          (pos 0)
;;          target-names)
;;     (while (string-match org-target-regexp value0 pos)
;;       (push (match-string 0 value0) target-names)
;;       (setq pos (match-end 0)))
;;     target-names))

(defun insert-blank-definitions ()
  "This enables us to not mess up line numbers when we run =find-definitions="
  ;;(interactive)
  (let* ((parsed-buffer (org-element-parse-buffer))
         (number-of-targets (org-element-map parsed-buffer 'src-block #'find-number-of-targets-for-each))
         (insert-locations (org-element-map parsed-buffer 'src-block #'blank-definitions-location-for-each))
         (target-names (apply #'append (org-element-map parsed-buffer 'src-block #'find-target-names)))
         (adjusted-tuple (adjust-line-numbers number-of-targets insert-locations))
         )
    (insert-blanks adjusted-tuple target-names)))

;;helpers:
(defun running-sum (lst)
  (cl-loop with sum = 0
        for x in lst
        collect (setf sum (+ sum x))))
(running-sum '(1 2 3 4))

;; (defun get-lines-to-skip ()
;;   "After each src-block, skip = number of definitions in it + number of usages in it.
;; Lines to skip = a cumulative sum of the above"
;;   (interactive)
;;   (let* ((parsed-buffer (org-element-parse-buffer))
;;          (number-of-refs (org-element-map parsed-buffer 'src-block #'find-number-of-refs-for-each))
;;          (number-of-targets (org-element-map parsed-buffer 'src-block #'find-number-of-targets-for-each)) ;defined elsewhere
;;          )
;;     (running-sum
;;      (cl-mapcar (lambda (r1 t1) (+ r1 t1))
;;                 number-of-refs number-of-targets))))


(defun adjust-line-numbers (number-of-targets insert-locations)
  "Adjust because inserting lines alters the line numbers from the original cached parsed buffer.
Returns a list of tuples of form (adjusted line number, number of blank definitions)"
  ;;the very first definition needs to skip 0 lines due to interference from 0 previous-
  ;;definition insertions
  (setq lines-to-skip (cons 0 (running-sum number-of-targets)))
  (cl-mapcar (lambda (num line skip)
               (list (+ line skip) num))
             number-of-targets insert-locations lines-to-skip))

(defun insert-blanks (list-of-tuples target-names)
  "Tuple of form ((l1, n1), (l2, n2))
At line l1, insert n1 definitions for target-name t1"
  (mapcar (lambda (tuple)
            (dotimes (skip (cadr tuple))
              (insert-blanks-helper (+ (car tuple) skip) (pop target-names))))
          list-of-tuples))

(defun insert-blanks-helper (line-number target-name)
  "At line-number, insert blank definition for given target-name"
  (goto-line line-number)
  (insert (format "/%s/ is defined at (BLANK PLACEHOLDER)\n" target-name)))
#+end_src

