ide.org
*** =insert-definitions=
Replace blank definitions with actual line numbered definitions
#+begin_src emacs-lisp :tangle ide.el
(defun insert-definitions ()
  ;;(interactive)
  (mapcar (lambda (tuple)
            (let* ((ref-name (car tuple))
                   (line-numbers (cadr tuple))
                   (line-numbers-links (linkify-line-numbers line-numbers)))
              (mark-whole-buffer)
              (replace-regexp-in-entire-buffer
               (eval `(rx line-start "\/" ,@ref-name "\/" " is defined at (BLANK PLACEHOLDER)\n"))
               (format "/%s/ is defined at %s\n" ref-name line-numbers-links))))
          (find-definitions)))

(defun linkify-line-numbers (line-numbers)
  (mapconcat #'identity
             (mapcar (lambda (line-number)
                       (format "[[file:::%s][%s]]" line-number line-number))
                     line-numbers)
             ", "))

(defun replace-regexp-in-entire-buffer (regexp0 replacement0)
  ;;(interactive)
  (beginning-of-buffer)
  (while (re-search-forward regexp0 nil t)
    (replace-match replacement0)))
#+end_src
*** =insert-usages=
Replace blank usages with actual line numbered usages
#+begin_src emacs-lisp :tangle ide.el
(defun insert-usages ()
  ;;(interactive)
  (mapcar (lambda (tuple)
            (let* ((target-name (car tuple))
                   (line-numbers (cadr tuple))
                   (line-numbers-links (linkify-line-numbers line-numbers)))
              (mark-whole-buffer)
              (replace-regexp-in-entire-buffer
               (eval `(rx line-start "\/" ,@target-name "\/" " is used at (BLANK PLACEHOLDER)\n"))
               (format "/%s/ is used at %s\n" target-name line-numbers-links))))
          (find-usages)))
#+end_src
*** insert usages and definitions
#+begin_src emacs-lisp :tangle ide.el
;; ORDER OF OPERATIONS IS IMPORTANT
;; 1. delete previously inserted definitions, and usages
;; 2. insert-blank-usages
;; 3. insert-blank-definitons
;; 4. insert-definitions: this regexp replaces blank definitions with real definitions
;; 4. insert-usages: this regexp replaces blank usages with real usages

(defun insert-usages-and-definitions ()
  ;;(interactive)
  (delete-all-definitions) (delete-all-usages) ;1
  (insert-blank-usages)                        ;2
  (insert-blank-definitions)                   ;3
  (insert-definitions) (insert-usages)         ;4
  )

(defun insert-literate-links0 ()
  (interactive)
  (display-line-numbers-mode)
  (insert-usages-and-definitions))
#+end_src
*** =M-.= should go to definitions/usage
**** TLDR on usage
=M-.= can be used whenever the cursor on any line with an org target. (any column)
=M-.= can also be used whenever the cursor is on the begin_src line. (any column)
=M-,= takes point to previous position
**** CANCELLED COMMENT org-ctags
There is a package named [[https://lists.gnu.org/archive/html/emacs-orgmode/2009-12/msg00670.html][Org-ctags]] that kinda does this  , but I found it to be confusing.
If its readme is soo confusing and require patches to builtin org.el file, I dont have much faith in its author.
Hence, writing my own config to do this.
But, you can still look at that package's workflow as described in its readme, and steal some ideas.
**** CANCELLED COMMENT TAGS
Let me author a TAGS file manually for [[file:~/today/2023-11-08/nice.org][nice.org]] by referring to [[https://en.wikipedia.org/wiki/Ctags#Etags_2][Ctags - Wikipedia]]
#+begin_quote Wikipedia format
\x0c {src_file},{size_of_tag_definition_data_in_bytes}
{tag_definition_text}\x7f{tagname}\x01{line_number},{byte_offset}
#+end_quote

#+begin_quote My generated TAGS

nice.org,74
<<Hello Function>>Hello Function13,268
<<Hello Name>>Hello Name14,287
#+end_quote

Therefore,
\x0c = ^L
\x7f = ^?
\x01 = ^A

What is byte_offset?
Its the number of bytes from the start of the file till where the function is defined.
source: [[https://stackoverflow.com/questions/1990579/understanding-the-ctags-e-file-format-ctags-for-emacs][c - Understanding the `ctags -e` file format (ctags for emacs) - Stack Overflow]]

I have started to hate this TAGS file format!

Why not just use an elisp list.
Wow! awesome idea

**** CANCELLED COMMENT TAGS0.el
Let me cache these into, say, ~./TAGS0.el~ file

Let me initially consider the trivial case of:-
one-definition   <--->    one-usage
1-1 relationship
#+begin_src emacs-lisp
(setq anup/tags '((":noweb-ref \"Hello Function\"" 293)
                  (":noweb-ref \"Hello Name\"" 312)
                  ("\<\<Hello Function\>\>" 60)
                  ("\<\<Hello Name\>\>" 160)))

(assoc "\<\<Hello Function\>\>" anup/tags) ;;("\<\<Hello Function\>\>" 293)
(cdr (assoc "\<\<Hello Function\>\>" anup/tags)) ;;(293)
#+end_src

The numbers correspond to the cursor position at which either the definition or usage occurs in the org file.
Why not just use ripgrep with helm completion?
Wow! even awesomer idea.
**** Is point at locations that are interesting for =M-.=
If point is at an interesting location, return that string. Return nil otherwise.

Assumptions for following codeblock:-
A line of text on my monitor is max 120 character
My noweb-ref name doesnt take up more than one line of text
My noweb target name doesnt take up more than one line of text
noweb-ref names are always surrounded by quotes, eg: ⁚noweb-ref “My Example Definition”
#+begin_src emacs-lisp :tangle ide.el
(defun anup/current-column-helper (point)
  (save-excursion
    (goto-char point)
    (current-column)))
(defun anup/current-column ()
  "Return column number at POINT."
  (save-excursion
    (goto-char (point))
    (current-column)))
(defun anup/length-of-current-line ()
  "Return length of the line on which the POINT lies"
  (- (line-end-position)
     (line-beginning-position)))
#+end_src

I am making an assumption or rule of thumb that I always need to follow for this package to work properly.
All noweb-ref names are inside quotation marks, always.
Someday, modifiy my regexp and substring calls below, such that, even when quotation marks are optional, this elisp setup of mine works.

My point will be looking at an usage of some literate block if:-
between it and begin of line, there exists a string that matches ~org-target-regexp~
In other words, it matches "«Some Target»"
(Note: this regexp is defined by some inbuilt library. I am just reusing it)

The following function could also have been named as /anup/looking-at-literate-target?/

Its necessary to move cursor to end of line using elisp function ~end-of-line~
Note that if you have visual-line-mode enabled, above function call *isnt* the same as keystroke ~C-e~
~looking-back~ searches from the its first argument (ie, beginning of the current line) until current cursor position (ie, end of line)

#+begin_src emacs-lisp :tangle ide.el
(defun anup/looking-at-literate-usage? ()
  "Return < <Some Target Name> > if cursor at some org target; Return nil otherwise"
  (let ((original-cursor-position (point))
        (closing-point0 (re-search-forward ">>" (line-end-position) t))
        (beginning-point0 (re-search-backward "<<" (line-beginning-position) t)))
    (goto-char original-cursor-position)
    (if (and closing-point0
             beginning-point0
             (< original-cursor-position closing-point0)
             (> original-cursor-position beginning-point0))
        (buffer-substring-no-properties beginning-point0 closing-point0)
      nil)))

(defalias 'anup/looking-at-literate-target? 'anup/looking-at-literate-usage?)
#+end_src

My point will be looking at a definition if:-
between it and begin of line, there exists a string that satisfies ~ref-name-regex~
In other words, it matches ~"My Example Definition"~ in ~⁚noweb-ref "My Example Defintion" :tangle /tmp/out.py~
Using elisp string concatenation, I build and return ~":noweb-ref \"My Example Definition\""~

Below function is very similar to ~anoop/org-in-src-block-header?~ but it returns not just a predicate, but a string.
#+begin_src emacs-lisp :tangle ide.el
(defun anup/looking-at-literate-definition? ()
  "Return ':noweb-ref My Example Definition' if cursor at some named org src block; Return nil otherwise"
  ;;(interactive)
  (let ((original-cursor-position (point)))
    ;;move cursor to end of line was causing bugs when:-
    ;;- either refname wasnt quoted
    ;;- or src header contained more arguments after \:noweb-ref
    ;;(end-of-line)
    (end-of-line)
    (if (looking-back ref-name-regex (- (point) (anup/current-column)))
        (progn (goto-char original-cursor-position)
               (concat ":noweb-ref " (s-trim-right (match-string-no-properties 1))))
      (progn (goto-char original-cursor-position) nil))))
#+end_src

**** CANCELLED COMMENT Jump cursor to definition or usage
For switching cursor position, ~helm-goto-line~ is better than ~goto-line~, because, it will reveal any hidden org headings if needed.
#+begin_src emacs-lisp :tangle ide.el
  ;; (defun anup/goto-definition ()
  ;;   (interactive)
  ;;   "Move point to the location where this literate named block is being utilized"
  ;;   (if-let* ((target-name (anup/looking-at-literate-usage?))
  ;; 	    (definition-name (concat ":noweb-ref \"" (substring target-name 2 -2) "\""))
  ;; 	    )
  ;;       (helm-goto-line (car (cdr (assoc definition-name anup/tags))))))

  ;; (defun anup/goto-usage ()
  ;;   (interactive)
  ;;   "Move point to the location where this literate named block is defined"
  ;;   (if-let* ((definition-name (anup/looking-at-literate-definition?))
  ;; 	    (target-name (concat "\<\<" (substring definition-name 13 -2) "\>\>")))
  ;;       (helm-goto-line (car (cdr (assoc target-name anup/tags))))))


  ;; (defun anup/goto-definition ()
  ;;   (interactive)
  ;;   nil)

  ;; (defun anup/goto-usage ()
  ;;   (interactive)
  ;;   nil)
#+end_src

Helpful temp keybindings while developing this code
#+begin_src emacs-lisp
;;(bind-keys* :map org-mode-map
;;            ("M-." . anup/goto-definition)
;;            ("M-," . anup/goto-usage))
#+end_src
**** CANCELLED COMMENT Generation 1-1 relationshiped TAGS0.el file
Actually, the many-many relationshiped TAGS0.le file will work even for the singular case of:-
~anup/goto-usage~ & ~anup/goto-definition~
**** CANCELLED COMMENT Generating a many-many relationshiped TAGS0.el assoc list
***** COMMENT =find-definitions2= finds all definitions of all "«Some Target»"
This is a modified version of [[*=find-definitions= for all src blocks -- "is defined at x,y,z"][=find-definitions= for all src blocks -- "is defined at x,y,z"]]
The following function ONLY changes the format of the output of the previously defined ~find-definitions~

Its modified to output result in a  assoc list format that I like for /TAGS0.el/
#+begin_src emacs-lisp :tangle ide.el
(defun find-definitions2 ()
  ;;since all targets must have a definition, it suffices to just iterate over ref-names
  ;;i.e. ref-names is always a superset of target-names
  (let (ret)
    (dolist (elt (find-definitions) ret)
      (setq ret (cons
                 (cons 
                  (concat ":noweb-ref " (car elt))
                  (cadr elt))
                 ret)))))
;;returns: (("Collect all functions" 16 23) ("The Main" 36))
#+end_src
