ide.el

(defun insert-definitions ()
  ;;(interactive)
  (mapcar (lambda (tuple)
            (let* ((ref-name (car tuple))
                   (line-numbers (cadr tuple))
                   (line-numbers-links (linkify-line-numbers line-numbers)))
              (mark-whole-buffer)
              (replace-regexp-in-entire-buffer
               (eval `(rx line-start "\/" ,@ref-name "\/" " is defined at (BLANK PLACEHOLDER)\n"))
               (format "/%s/ is defined at %s\n" ref-name line-numbers-links))))
          (find-definitions)))

(defun linkify-line-numbers (line-numbers)
  (mapconcat #'identity
             (mapcar (lambda (line-number)
                       (format "[[file:::%s][%s]]" line-number line-number))
                     line-numbers)
             ", "))

(defun replace-regexp-in-entire-buffer (regexp0 replacement0)
  ;;(interactive)
  (beginning-of-buffer)
  (while (re-search-forward regexp0 nil t)
    (replace-match replacement0)))

(defun insert-usages ()
  ;;(interactive)
  (mapcar (lambda (tuple)
            (let* ((target-name (car tuple))
                   (line-numbers (cadr tuple))
                   (line-numbers-links (linkify-line-numbers line-numbers)))
              (mark-whole-buffer)
              (replace-regexp-in-entire-buffer
               (eval `(rx line-start "\/" ,@target-name "\/" " is used at (BLANK PLACEHOLDER)\n"))
               (format "/%s/ is used at %s\n" target-name line-numbers-links))))
          (find-usages)))

;; ORDER OF OPERATIONS IS IMPORTANT
;; 1. delete previously inserted definitions, and usages
;; 2. insert-blank-usages
;; 3. insert-blank-definitons
;; 4. insert-definitions: this regexp replaces blank definitions with real definitions
;; 4. insert-usages: this regexp replaces blank usages with real usages

(defun insert-usages-and-definitions ()
  ;;(interactive)
  (delete-all-definitions) (delete-all-usages) ;1
  (insert-blank-usages)                        ;2
  (insert-blank-definitions)                   ;3
  (insert-definitions) (insert-usages)         ;4
  )

(defun insert-literate-links0 ()
  (interactive)
  (display-line-numbers-mode)
  (insert-usages-and-definitions))

(defun anup/current-column-helper (point)
  (save-excursion
    (goto-char point)
    (current-column)))
(defun anup/current-column ()
  "Return column number at POINT."
  (save-excursion
    (goto-char (point))
    (current-column)))
(defun anup/length-of-current-line ()
  "Return length of the line on which the POINT lies"
  (- (line-end-position)
     (line-beginning-position)))

(defun anup/looking-at-literate-usage? ()
  "Return < <Some Target Name> > if cursor at some org target; Return nil otherwise"
  (let ((original-cursor-position (point))
        (closing-point0 (re-search-forward ">>" (line-end-position) t))
        (beginning-point0 (re-search-backward "<<" (line-beginning-position) t)))
    (goto-char original-cursor-position)
    (if (and closing-point0
             beginning-point0
             (< original-cursor-position closing-point0)
             (> original-cursor-position beginning-point0))
        (buffer-substring-no-properties beginning-point0 closing-point0)
      nil)))

(defalias 'anup/looking-at-literate-target? 'anup/looking-at-literate-usage?)

(defun anup/looking-at-literate-definition? ()
  "Return ':noweb-ref My Example Definition' if cursor at some named org src block; Return nil otherwise"
  ;;(interactive)
  (let ((original-cursor-position (point)))
    ;;move cursor to end of line was causing bugs when:-
    ;;- either refname wasnt quoted
    ;;- or src header contained more arguments after \:noweb-ref
    ;;(end-of-line)
    (end-of-line)
    (if (looking-back ref-name-regex (- (point) (anup/current-column)))
        (progn (goto-char original-cursor-position)
               (concat ":noweb-ref " (s-trim-right (match-string-no-properties 1))))
      (progn (goto-char original-cursor-position) nil))))
