ide.org
***** COMMENT =find-usages2= finds all usages of all :noweb-ref
This is a modified version of [[*=find-usages= for all src blocks -- "is used at a,b,c"][=find-usages= for all src blocks -- "is used at a,b,c"]]
The following function ONLY changes the format of the output of the previously defined ~find-usages~

Its modified to output result in a  assoc list format that I like for /TAGS0.el/
#+begin_src emacs-lisp :tangle ide.el
;;note: this also includes unused definitions
(defun find-usages2 ()
  (let (ret)
    (dolist (elt (find-usages) ret)
      (if (cadr elt) ;;to filter out nil, this is a temp bugfix, will remove it when I bugfix find-usages
          (setq ret (cons
                     (cons (concat "\<\<" (car elt) "\>\>") (cadr elt))
                     ret))))));;returns: (("\<\<Collect all functions\>\>" 25 70) ("\<\<The Main\>\>" 49))
#+end_src
***** CANCELLED define anup/tags
#+begin_src emacs-lisp :tangle ide.el
;;(setq anup/tags (append (find-definitions2) (find-usages2)))
(defun anup/tags2 ()
  (interactive)
  (append (find-definitions2) (find-usages2)))
#+end_src

**** CANCELLED COMMENT Handling many-many relationships during M-. and M-,
**** making use of +ripgrep+ ag-the-silver-searcher to jump around
***** why helm-ag.el is the best library for my usecase?
Why not just ripgrep the buffer for string of the form "< <Some Target> >" and "⁚noweb-ref \"Some Target\""

#+begin_src emacs-lisp
(rg-define-search search-for-hello-function-definition
    "Search current buffer for noweb-ref Hello Function"
    :query " :noweb-ref \"Hello Function\""
    :flags ("--no-ignore")
    :format literal
    :files (buffer-name)
    :dir current)
#+end_src
Above works, but I dont like the UI of rg.el
Let me try some helm-ified ripgrep elisp package
One major drawback of this method is that it doesnt work in /indirect narrowed headings buffers/

counsel-rg is buggy for me
#+begin_src emacs-lisp
(counsel-rg ":noweb-ref \"exwm-binds\"") ;;fails due to cryptic error code 2
#+end_src

So, trying out  /counsel-ag/ which happens to be bundled with /counsel/.
#+begin_src emacs-lisp
;;(counsel-ag ":noweb-ref" "/home/anoop/today/2023-11-08/" "--context 2");;fails if you give --context
;;(counsel-ag ":noweb-ref" "/home/anoop/today/2023-11-08/" "-C 2");;fails if you give --context
#+end_src
Ruling it out because I didnt find an easy method to run counsel-ag on /just current file/
Although the full form syntax '--context' fails, the short form '-C' strangely succeeds.

#+begin_src emacs-lisp
;;(helm-ag-this-file " :noweb-ref \"Hello Function\"") ;;works
#+end_src

However, /helm-ag/ doesnt support passing "--context 3" to the ag binary.
Context represents the number of lines to show in results around a match.

Let me postpone the implementation of showing context around a match to a future date.
In that case, helm-ag fits my needs

+I faced problems with helm-ag-this-file when the query contained double quotes.+
As long as I escape the double quote, I felt it works fine.
---------------------------------------------------------------------------------------------------
+Hence, switching to counsel-ag.+
#+begin_src emacs-lisp
(counsel-ag ":noweb-ref \"exwm-binds\"" nil "-C 3 --norecurse --noheading --case-sensitive --file-search-regex temp.org$" "Find definitions for:-")
#+end_src	      
^See if you can figure out how to hide column numbers in results.

I couldnt get ~counsel-ag~ to respect OR clauses ie ~|~ properly
---------------------------------------------------------------------------------------------------
After switching away from counsel to consult, I would prefer to not use any counsel functions.
Hence, switching to ~consult-ripgrep~
#+begin_src emacs-lisp
(consult-ripgrep "/home/anup/today/2024-11-12" ":noweb-ref \"hello\\ world\" -- --context 3 --case-sensitive test.org")
#+end_src
I noticed that since consult updates the cursor position, and gives a live preview in the main window, I dont need context.
#+begin_src emacs-lisp
(consult-ripgrep "/home/anup/today/2024-11-12" ":noweb-ref \"hello\\ world\" -- --case-sensitive test.org")
#+end_src
Above is not searching just the =test.org= file. It is running on all files in directory. Lets fix it.
#+begin_src emacs-lisp
(let ((consult-project-function (lambda (_x) nil)))
  (consult-ripgrep (list "/home/anup/today/2024-11-12/test.org") ":noweb-ref \"hello\\ world\" -- --case-sensitive"))
#+end_src
---------------------------------------------------------------------------------------------------
Let me take a second look at helm-ag.
Even if it doenst support /context/, but if it support ~|~, then I might prefer it over ~counsel-ag~

I can confirm that it does support the ~|~ clause
#+begin_src emacs-lisp
(helm-ag-this-file ":noweb-ref \"Hello Function\"|:noweb-ref Hello Function") ;works
#+end_src

Unfortunately, this doesnt work when the query is too long, such as:-
#+begin_src emacs-lisp
(helm-ag-this-file ":noweb-ref \"Ponomial Package/=zero?\"|:noweb-ref Ponomial Package/=zero?|:noweb-ref \"Ponomial Package/=zero\?\"")
#+end_src
^Errors out:-
#+begin_example
helm-M-x-execute-command: No ag output: ’:noweb-ref "Ponomial Package/=zero?"|:noweb-ref Ponomial Package/=zero?|:noweb-ref "Ponomial Package/=zero\?"’
#+end_example
---------------------------------------------------------------------------------------------------
Someday maybe, check org-ql package to query the current orgfile.
---------------------------------------------------------------------------------------------------
*Explorations:-*
How about ~helm-rg~
Does using helm-rg--expand-match-context and/or helm-rg--spread-match-context help?

Currently, counsel-ag is the only one able to show me context around a match.
But, context isnt as important as ~|~

#+begin_src emacs-lisp
(defun temp ()
  (interactive)
  (let* ((anup/file-name (file-name-nondirectory buffer-file-name))
         (helm-rg-default-glob-string anup/file-name)
         (helm-rg-prepend-file-name-line-at-top-of-matches nil)
         (helm-rg-default-extra-args "--case-sensitive") ;;works
         ;;(helm-rg-default-extra-args "--context 1") ;;doesnt work
         ;;(helm-rg-default-extra-args "--context 5 --case-sensitive");; doesnt work
         )
    (helm-rg ":noweb-ref \"Hello Function\"")
    ))
#+end_src

Although helm-rg doesnt support context around match, it supports OR clauses properly, unlike ~counsel-ag~
+The day I figure out how to show ~--before-context 3 --after-context 3~ , I will adopt this over counsel-ag.+
Will switch to helm-rg after I figure out how to make ~helm-rg~ search JUST the current file and not the entire current folder
#+begin_src emacs-lisp
(helm-rg ":noweb-ref \"Hello Function\"|:noweb-ref Hello Function" nil "current-file-name")
#+end_src
^doesnt work

Someday, try =consult-ripgrep= and see if it is better than =counsel-ag=

***** anup/goto-definition and anup/goto-usage
Goes to the literate definition and the literate usage respectively.

A helper function
#+begin_src emacs-lisp :tangle ide.el
(defun anup/replace-in-string (what with in)
  (replace-regexp-in-string (regexp-quote what) with in nil 'literal))
#+end_src

#+begin_src emacs-lisp :tangle ide.el
(defun anup/goto-definition ()
  (interactive)
  "Move point to the location where this literate named block is being utilized"
  (if-let* ((target-name (anup/looking-at-literate-usage?))
            ;;trim angle brackets
            (_ref-name (substring target-name 2 -2))
            ;;spaces inside double quotes arent matched properly unless they are escaped
            (_ref-name (string-replace " " "\\ " _ref-name))
            ;;llly question mark also needs escaping
            (_ref-name (string-replace "?" "\\?" _ref-name))
            (definition-name (concat ":noweb-ref \"" _ref-name "\""))

            ;;;;;;disabled because it is OR is not working in counsel-ag
            ;;;;;;because sometimes noweb-ref names are written without double quotes in orgfiles
            ;;;;(definition-name-remove-double-quotes (anup/replace-in-string "\"" "" definition-name))
            ;;;;
            ;;;;;;because sometimes refnames may contain question marks
            ;;;;(definition-name-escape-question-mark (anup/replace-in-string "?" "\\?" definition-name))
            ;;;;
            ;;;;;;combine all the above cases into a query that can be sent into grep
            ;;;;(query (concat definition-name "|"
            ;;;;               definition-name-remove-double-quotes "|"
            ;;;;               definition-name-escape-question-mark))
            
            (file-name (file-name-nondirectory buffer-file-name))
            (directory-name (file-name-directory buffer-file-name)))
      ;;(helm-ag-this-file query)
      ;;(counsel-ag definition-name nil (format "-C 3 --norecurse --noheading --case-sensitive --file-search-regex %s$" file-name) "")

      ;; --no-heading isnt working
      ;;(consult-ripgrep (list (shell-quote-argument buffer-file-name))
      ;;                 (format "%s -- --case-sensitive --no-heading" definition-name))
      
      ;;The first argument limits the search to just the current file
      (consult-ripgrep (list (shell-quote-argument buffer-file-name)) (format "%s -- --case-sensitive" definition-name))))
#+end_src
I dont know how to send counsel-rg a query that asks it match either of two queries.
TODO That would be helpful for my usecase of treating quoted and unquoted noweb refnames as both valid.

^Bug: Why does ~counsel-ag~ fail to match whenever the definition name contains a ~,~ in its noweb refname.
This bug isnt due to my code. Its a bug within the library ~counsel-ag~.
Current workaround: Dont use comma ie ~,~ inside refnames. Just use fullstop ie ~.~ instead.

Be careful of any string containing arrows. org-babel will interpret them as noweb-ref targets.
Therefore, you should either escape them with backslashes, -
-or, add an ~:noweb-ref no~ header to such src blocks. [[*A snippet to insert SICP source blocks in org-mode][Eg]].
#+begin_src emacs-lisp :tangle ide.el
(defun anup/goto-usage ()
  (interactive)
  "Move point to the location where this literate named block is defined"
  (if-let* ((definition-name (anup/looking-at-literate-definition?))
            <<Extract target-name>>)

      ;;decided against helm-ag
      ;;(helm-ag-this-file target-name)

      ;;bug:- --nofilename isnt working
      ;;(counsel-ag target-name nil (format "-C 3 --norecurse --noheading --case-sensitive --file-search-regex %s$" file-name) "")

      ;; --no-line-number isnt working in the format string due to some bug
      (consult-ripgrep (list (shell-quote-argument buffer-file-name)) (format "%s -- --case-sensitive" target-name))))
#+end_src

Let us remove doublequotes (if present) from definition name. This makes this function handle both the cases of un-doublequoted or doublequoted ref naming gracefully.
#+begin_src emacs-lisp :noweb-ref "Extract target-name"
(_ref-name (substring definition-name 11))
;;strip double quotes
(_ref-name (anup/replace-in-string "\""
                                   ""
                                   _ref-name))
;;escape spaces
(_ref-name (string-replace " " "\\ " _ref-name))
;;escape question mark
(_ref-name (string-replace "?" "\\?" _ref-name))
(target-name (concat "\<\<" _ref-name "\>\>"))
#+end_src

****** COMMENT keybind them
^deprecated in favor of routed version at [[*Intelligently route /go to definition/ according to where it is called from][Intelligently route /go to definition/ according to where it is called from]]

Bind them in the org's use-package declaration's ~:bind*~
#+begin_src emacs-lisp :noweb-ref "From/Literate Programming. To/org/org-mode-map/bind_star"
("M-." . anup/goto-definition)
("M-," . anup/goto-usage)
#+end_src

**** bugs
If refname contains ~?~, then it isnt treated literally. It is treated as some sort of regexp specification.
Maybe adding ~--literal~ to ~ag~ options helps? Ans: No, it doesnt work for some reason.
*** COMMENT someday
delete all previous "Usages at bla bla"  before updating
automatically insert "This code is used at line numbers x, y, z" & "See definitions at line numbers a, b, c"
"See definitions at line numbers a, b, c" needs de-duplication if used multiple times in the same block

cache (org-element-parse-buffer) as its a slow function

**** COMMENT +org-ql  :  a package to query org buffers with elisp+
use org-ql to simplify my code
#+begin_src emacs-lisp :tangle ide.el
(use-package org-ql)
(use-package helm-org-ql)
#+end_src
Problem: this seems to navigate to the org headings only :(

