ide.el

(defun anup/replace-in-string (what with in)
  (replace-regexp-in-string (regexp-quote what) with in nil 'literal))

(defun anup/goto-definition ()
  (interactive)
  "Move point to the location where this literate named block is being utilized"
  (if-let* ((target-name (anup/looking-at-literate-usage?))
            ;;trim angle brackets
            (_ref-name (substring target-name 2 -2))
            ;;spaces inside double quotes arent matched properly unless they are escaped
            (_ref-name (string-replace " " "\\ " _ref-name))
            ;;llly question mark also needs escaping
            (_ref-name (string-replace "?" "\\?" _ref-name))
            (definition-name (concat ":noweb-ref \"" _ref-name "\""))

            ;;;;;;disabled because it is OR is not working in counsel-ag
            ;;;;;;because sometimes noweb-ref names are written without double quotes in orgfiles
            ;;;;(definition-name-remove-double-quotes (anup/replace-in-string "\"" "" definition-name))
            ;;;;
            ;;;;;;because sometimes refnames may contain question marks
            ;;;;(definition-name-escape-question-mark (anup/replace-in-string "?" "\\?" definition-name))
            ;;;;
            ;;;;;;combine all the above cases into a query that can be sent into grep
            ;;;;(query (concat definition-name "|"
            ;;;;               definition-name-remove-double-quotes "|"
            ;;;;               definition-name-escape-question-mark))
            
            (file-name (file-name-nondirectory buffer-file-name))
            (directory-name (file-name-directory buffer-file-name)))
      ;;(helm-ag-this-file query)
      ;;(counsel-ag definition-name nil (format "-C 3 --norecurse --noheading --case-sensitive --file-search-regex %s$" file-name) "")

      ;; --no-heading isnt working
      ;;(consult-ripgrep (list (shell-quote-argument buffer-file-name))
      ;;                 (format "%s -- --case-sensitive --no-heading" definition-name))
      
      ;;The first argument limits the search to just the current file
      (consult-ripgrep (list (shell-quote-argument buffer-file-name)) (format "%s -- --case-sensitive" definition-name))))

(defun anup/goto-usage ()
  (interactive)
  "Move point to the location where this literate named block is defined"
  (if-let* ((definition-name (anup/looking-at-literate-definition?))
            (_ref-name (substring definition-name 11))
;;strip double quotes
(_ref-name (anup/replace-in-string "\""
                                   ""
                                   _ref-name))
;;escape spaces
(_ref-name (string-replace " " "\\ " _ref-name))
;;escape question mark
(_ref-name (string-replace "?" "\\?" _ref-name))
(target-name (concat "\<\<" _ref-name "\>\>")))

      ;;decided against helm-ag
      ;;(helm-ag-this-file target-name)

      ;;bug:- --nofilename isnt working
      ;;(counsel-ag target-name nil (format "-C 3 --norecurse --noheading --case-sensitive --file-search-regex %s$" file-name) "")

      ;; --no-line-number isnt working in the format string due to some bug
      (consult-ripgrep (list (shell-quote-argument buffer-file-name)) (format "%s -- --case-sensitive" target-name))))
