ide.org
** CANCELLED Look into how to import a disk file into org buffer using #+INCLUDE
But, now the external file will be treated as the single source of truth, instead of the orgfile exporting to the external file
This is kinda reverse of the strategy of treating org buffer as the single source of truth that git check-in-ed and then tangled to external files.
Therefore, this workflow may not suit my needs. I want to retain the ability to git checkin the orgmode buffer as the source of truth.
^Look into alternative sister elisp functions similar to #+INCLUDE
** TODO automatic index generation
At the end of the book, an index of each of the variables_names & functions; pointing to the page numbers where they are used.
Generate such an hyperlinked index automatically.
** study howard abrahm's tower of babel
https://github.com/howardabrams/dot-files/tree/master/babel
** TODO mouseover or hover should show /definitions/ and /usages/ links
https://emacs.stackexchange.com/questions/54319/how-to-display-target-of-an-org-mode-link-in-the-echo-area-or-as-tooltip
Go to defintion M-. links should be shown on mouseover
It may be too noisy to turn on on_cursor_over, I think a happy middle ground is to only enable mouseover
Embark might be useful to implement this.
** TODO quokka.js for emacs?
A similar implementation for Clojurescript is available.
** COMMENT ricing orgmode to look like a book
[[https://lepisma.xyz/2017/10/28/ricing-org-mode/index.html][Ricing up Org Mode]]
also see Rougier's book-mode & nano-theme. Also learn to export orgfiles using Rougier's CSS by studying [[https://github.com/rougier/emacs-gtd][rougier/emacs-gtd: Get Things Done with Emacs - github.com/rougier/emacs-gtd]]

Orgmode add ability to pick color of text using inline tag. Eg:- <red>Anoop</red> should render my name in red text.

Look into turing on =pixel-scroll-precision-mode= globally, after upgrading to faster desktop

Make it easy to insert images from phone into orgmode.
- First figure out how to access my computer from the internet using /tailscale/
- Now create an android app that launches a camera
- As soon as you click the shutter, the image should appear on my computer
       OR
- Learn to use my android as the webcam of my PC
- Now org insert image, should optinally trigger an option to launch/ready my android camera for doc scanning.
** raise errors if noweb-refs dont resolve, for all languages
#+begin_src emacs-lisp :noweb-ref "org/config"
(setq org-babel-noweb-error-all-langs t)
#+end_src
** CANCELLED I need a way to redefine existing noweb-refs
^But first study TexBook to see if Donald Knuth redefines existing named blocks or not. I would wager that he doesn't. Therefore, this TODO is deprecated.
Doubt: In Knuth's web, does ~≣~ re-define existing definition if used multiple times?

I have found by experimentation that ~:noweb-ref~ adds to existing.

| Knuth's syntax | noweb ref syntax |
|----------------+------------------|
| ≣              | #+name:          |
| +≣             | :noweb-ref       |
|----------------+------------------|

ie, I can use the following convention:-
Use ~#+name: <some_name>~ to define blocks to which you are never gonna make any more additions.
Use ~:noweb-ref~ to define blocks to which you *will* make future additions.

~#+name:~ refers to a singular src block, whereas noweb-ref refers to a collection of one or more src blocks as per [[info:org#Noweb Reference Syntax][org#Noweb Reference Syntax]]

** WAITING COMMENT [[https://emacs.stackexchange.com/questions/28491/insert-noweb-references-with-completion][org mode - Insert noweb references with completion - Emacs Stack Exchange]]
The stackoverflow answer seemed not targetted to company or ivy.
Found another answer targetting company-mode. Hence prefer the latter.
Stolen from [[https://lists.gnu.org/archive/html/emacs-orgmode/2018-11/msg00090.html][[O] company-mode completions for noweb references]]
#+begin_src emacs-lisp :tangle ide.el
(defun anoop/org-src-block-name-backend (command &optional arg &rest ignored)
  "Complete `<<' with the names of defined SRC blocks."
  (interactive (list 'interactive))
  (cl-case command
    (interactive (company-begin-backend 'anoop/org-src-block-name-backend))
    (init (require 'org-element))
    (prefix (and (eq major-mode 'org-mode)
                 (eq 'src-block (car (org-element-at-point)))
                 (cons (company-grab-line "^<<\\(\\w*\\)" 1) t)))
    (candidates
     (org-element-map (org-element-parse-buffer) 'src-block
       (lambda (src-block)
         (let ((name (org-element-property :name src-block)))
           (when name
             (propertize
              name
              :value (org-element-property :value src-block)
              :annotation (org-element-property :raw-value (org-element-lineage src-block '(headline)))))))))
    (sorted t)            ; Show candidates in same order as doc
    (ignore-case t)
    (duplicates nil)               ; No need to remove duplicates
    (post-completion               ; Close the reference with ">>"
     (insert ">>"))
    ;; Show the contents of the block in a doc-buffer. If you have
    ;; company-quickhelp-mode enabled it will show in a popup
    (doc-buffer (company-doc-buffer (get-text-property 0 :value arg)))
    (annotation (format " [%s]" (get-text-property 0 :annotation arg)))))

(add-to-list 'company-backends 'anoop/org-src-block-name-backend)
#+end_src

I didnt get a chance to check whether above works or not.
Because, company-mode isnt autocompleting when major mode is org-mode. I need to fix that first. Hence, commented out.
** prevent orgmode from repeating the prefix text before noweb-targets
You can use the src block header ~:noweb-prefix no~ if you want prevent orgmode from repeating the text to the left of a target into each line of tangled target.

ie,
Previously, whenever a noweb reference appeared on a non-empty line, a multi-line replacement would duplicate the content before the noweb reference.

Clearly, this is almost always not desirable, and this behaviour can now be turned of by setting the new header argument :noweb-prefix no.

I have globally disabled the noweb-prefix by default in my emacs configuration.
To enable it for a particular block, I need to add the header argument ~:noweb-prefix "yes"~ or ~:noweb-prefix yes~
** study this famous noweb =wc= program
[[https://www.cs.tufts.edu/~nr/noweb/examples/wc.html][An Example of noweb by Norman Ramsay]]
** COMMENT Set the visibility state for an individual source block
^disabled because on migrating from emacs-29 to emacs-30-igc, I started getting a bug while opening job.org file.

source: [[https://emacs.stackexchange.com/questions/44914/choose-individual-startup-visibility-of-org-modes-source-blocks][org babel - Choose individual startup visibility of org-mode's source blocks - Emacs Stack Exchange]]
#+begin_src emacs-lisp :tangle ide.el :hidden
(defun individual-visibility-source-blocks ()
  "Fold some blocks in the current buffer."
  (interactive)
  (org-show-block-all)
  (org-block-map
   (lambda ()
     (let ((case-fold-search t))
       (when (and
              (save-excursion
                (beginning-of-line 1)
                (looking-at org-block-regexp))
              (cl-assoc
               ':hidden
               (cl-third
                (org-babel-get-src-block-info))))
         (org-hide-block-toggle))))))

(add-hook
 'org-mode-hook
 (function individual-visibility-source-blocks))
#+end_src
Henceforth, adding a ~:hidden~ to some src header makes those source blocks hidden on initial file open.

Now I can neatly lay out my orgfile such that only those src blocks that need to be read to understand the file are visibile.
For most blocks, the prose above those blocks should suffice.
ie, try to write prose such that you are able to hide most src blocks.
I will encourage myself to achieve this by adding ~:hidden~ to all my src block insertion templates.

BTW, entire org headings can be hidden by adding the following property:-
:PROPERTIES:
:VISIBILITY: folded
:END:
Note that properties are respected /only if/ they are added immediately following the heading line.
** TODO Read [[http://eschulte.github.io/org-scraps/][awesome orgmode examples]]
** COMMENT Enable macros during tangle
no longer works source:- http://eschulte.github.io/org-scraps/
Newer solution source [[https://list.orgmode.org/CAGY83EfBuCJ+3-ZsmefsYsbhG=QBW3b9cfkx_sHCJDLj-C360g@mail.gmail.com/T/][How to expand macros in tangled code blocks?]]

This solution makes use of file local variable feature of emacs.
I need to add the following snippet into any orgfile in which I want macro expansion to happen /even/ in src blocks.

I need to add a “local variables list” /near the end/ of the file.  The start of
the local variables list should be no more than 3000 characters from the
end of the file, and must be on the last page if the file is divided
into pages.

#+begin_quote Add
# Local Variables:
# eval: (add-hook 'org-babel-pre-tangle-hook (lambda () (setq zz/saved-macro-templates org-macro-templates)) :append :local)
# eval: (add-hook 'org-babel-post-tangle-hook (lambda () (makunbound 'zz/saved-macro-templates)) :append :local)
# eval: (add-hook 'org-babel-tangle-body-hook (lambda () (when (boundp 'zz/saved-macro-templates) (org-macro-replace-all zz/saved-macro-templates))) :append)
# End:
#+end_quote

*** Usage:-
#+MACRO: myincr $1=$1+1
#+MACRO: mymultiply $1*$2
#+begin_src python :tangle /tmp/temp.py
x = 3.14
{{{myincr(x)}}}
z = {{{mymultiply(x,y)}}} #z = x*y gets inserted
print(x) #4.14 gets printed
#+end_src

*** TODO Try to make above work even for =C-c C-c=, not just tangled output
** Find out how [[https://github.com/mmp/pbrt-v4][mmp/pbrt-v4: Source code to pbrt, the ray tracer described in the forthcoming 4th edition of the "Physically Based Rendering: From Theory to Implementation" book.]] handles collaborators & pull requests on a literate project
** I like making multiple indirect buffers
+^I have disabled this desirable feature because of a bug in it.+

By default ~org-tree-to-indirect-buffer~ will close the previous indirect buffer when opening a new one.
But, if called with a prefix argument, it will make a new indirect buffer WITHOUT closing previous ones.
Retaining those previous ones is desirable for my usecase, as I could be working/editing them for some other project.

#+begin_src emacs-lisp :tangle ide.el
(defun org-tree-to-indirect-buffer2 ()
  "Like org-tree-to-indirect-buffer, but always creates a new indirect buffer, wont close previous ones."
  (interactive)
  (let ((current-prefix-arg '(4)))
    (call-interactively 'org-tree-to-indirect-buffer)))

(setq org-indirect-buffer-display 'current-window)

(put 'org-tree-to-indirect-buffer 'disabled "Use org-tree-to-indirect-buffer2 instead0")
;;below was by default bound to the above disabled command, let me rebind it to improved version
(keymap-set org-mode-map "<remap> <org-tree-to-indirect-buffer>" 'org-tree-to-indirect-buffer2)
#+end_src

*** TODO intermittent bug
#+begin_quote intermittent bug
Sometimes, not all sub headings of the currently focused heading are
detected properly. Multiple times, the tail was cutoff somewhere. ie,
Several headings after a certain number of headings cease to be
detected to be moved into the new indirect buffer.

Hence, for now, dont enable this feature, until finding a cure to this problem.
Strangely, this bug disappers inside tty emacs, with my full .emacs config loaded.
So, whats causing this bug in orgmode when running on EXWM?
#+end_quote

#+begin_quote stacktrace of bug
⛔ Warning (org-element-cache): org-element--cache: Org parser error in job.org::WAITING =desivanlife.com= Vanlife Tempo Traveller::4646612. Resetting.
 The error was: (error "Invalid search bound (wrong side of point)")
 Backtrace:
"  backtrace-to-string(nil)
  org-element-at-point()
  org-element-context()
  org-appear--current-elem()
  org-appear--post-cmd()
"
 Please report this to Org mode mailing list (M-x org-submit-bug-report).
#+end_quote

If the tail is prematurely getting truncated, then, the bug is related to:-
[[file:/usr/local/share/emacs/29.1.90/lisp/org/org.el.gz::org-end-of-subtree t t][ensure that ~(org-end-of-subtree t t)~ command does go to the end of the heading to be narrowed + 1 character forward]]

** COMMENT Go to definition using Tags file
^disabled because its annoying to maintain an updated TAGS file. Hence, switched to dumb-jump

Set the keybindings
#+begin_src emacs-lisp :tangle ide.el
(bind-keys :map org-mode-map
           ("C-c M-." . xref-find-definitions)
           ("C-c M-," . xref-go-back))
#+end_src

ctags is old. Emacs bundles this along.
exuberent-ctags is an improvement of old ctags. But its currently abandoned.
universal-ctags is a maintained fork of exuberant-ctags.
So, =I choose universal-ctags=, installed using ~yay -S uctags-git~
Its installed by AUR at =/usr/bin/ctags=

*** COMMENT For SICP.org
#+begin_src emacs-lisp :tangle ide.el
(defun create-sicp-tags0 ()
  "Create tags file."
  (shell-command "/usr/bin/ctags --output-format=etags --language-force=Scheme SICP2.org")
  (shell-command "/usr/bin/ctags --output-format=etags --language-force=Scheme --append '/home/anoop/documents0/srfi-203/srfi/203/203.scm'")
  (shell-command "/usr/bin/ctags --output-format=etags --language-force=Scheme --append '/home/anoop/documents0/srfi-216/srfi/216/216.scm'"))

(defun update-sicp-tags0 ()
  "Recreate the tags file."

  ;;update TAGS, but still not de-duplicated:-
  ;;(shell-command "/usr/bin/ctags --output-format=etags --language-force=Scheme --append SICP.org")

  ;;I have chosen to recreate the tags file each time since its quite fast for my purposes
  ;;If I had instead chosen to --append, then I would have to de-duplicate the generated TAGS file -
  ;;in order to keep it from growing arbitrarily large
  (create-sicp-tags0))

(defun update-sicp-tags-and-refresh-etags0 ()
  (interactive)
  (update-sicp-tags0)
  (let ((tags-revert-without-query t))  ;;dont prompt user to confirm the re-read of new TAGS file
    (visit-tags-table default-directory nil)))
#+end_src

Update TAGS file on /Not found error/
#+begin_src emacs-lisp :tangle ide.el
(defadvice xref-find-definitions (around refresh-etags activate)
  "Rerun etags and reload tags if tag not found and redo find-tag.              
   If buffer is modified, ask about save before running etags."
  (condition-case err
      ad-do-it
    (if (equal (buffer-file-name) "/home/anoop/sicp0/SICP2.org")
        (error (and (buffer-modified-p)
                    (not (ding))
                    (y-or-n-p "Buffer is modified, save it? ")
                    (save-buffer))
               (update-sicp-tags-and-refresh-etags0)
               ad-do-it))))
#+end_src
^This trick seems to be not working for me.

