ide.el

(defun org-tree-to-indirect-buffer2 ()
  "Like org-tree-to-indirect-buffer, but always creates a new indirect buffer, wont close previous ones."
  (interactive)
  (let ((current-prefix-arg '(4)))
    (call-interactively 'org-tree-to-indirect-buffer)))

(setq org-indirect-buffer-display 'current-window)

(put 'org-tree-to-indirect-buffer 'disabled "Use org-tree-to-indirect-buffer2 instead0")
;;below was by default bound to the above disabled command, let me rebind it to improved version
(keymap-set org-mode-map "<remap> <org-tree-to-indirect-buffer>" 'org-tree-to-indirect-buffer2)
