ide.org
*** For Seabiscuit
#+begin_src emacs-lisp :tangle ide.el
(defun create-seabiscuit-tags0 ()
  "Create tags file."
  (shell-command "ctags-universal --output-format=etags --language-force=Clojure app1.org")
  ;;ctags cannot read jar files, so below fails
  ;;(shell-command "ctags-universal --output-format=etags --language-force=Clojure --recurse=yes --append '/home/anup/.m2/repository/'")
  )
#+end_src
I have a workaround for ctags not being able to read jar files.
For library code, I will just go into clojure mode using =C-c '= and then press =M-.= which Cider will magically handle.

#+begin_src emacs-lisp :tangle ide.el
(defun update-seabiscuit-tags0 ()
  "Recreate the tags file."
  ;;update TAGS, but still not de-duplicated:-
  ;;(shell-command "ctags-universal --output-format=etags --language-force=Clojure --append app1.org")

  ;;I have chosen to recreate the tags file each time since its quite fast for my purposes
  ;;If I had instead chosen to --append, then I would have to de-duplicate the generated TAGS file -
  ;;in order to keep it from growing arbitrarily large
  (create-seabiscuit-tags0))

(defun update-seabiscuit-tags-and-refresh-etags0 ()
  (interactive)
  (update-seabiscuit-tags0)
  (let ((tags-revert-without-query t))  ;;dont prompt user to confirm the re-read of new TAGS file
    (visit-tags-table default-directory nil)))
#+end_src

Update TAGS file on /Not found error/
#+begin_src emacs-lisp :tangle ide.el
(defadvice xref-find-definitions (around refresh-etags activate)
  "Rerun etags and reload tags if tag not found and redo find-tag.              
   If buffer is modified, ask about save before running etags."
  (message "It was indeed called")
  (condition-case err
      ad-do-it
    (if (equal (buffer-file-name) "/home/anup/vet0/app1/app1.org")
        (error (and (buffer-modified-p)
                    (not (ding))
                    (y-or-n-p "Buffer is modified, save it? ")
                    (save-buffer))
               (update-seabiscuit-tags-and-refresh-etags0)
               ad-do-it))))
#+end_src
^This trick is not working for me.
*** COMMENT john kitchen
I have disabled this because I prefer a simplified version of this library that I customised myself.
https://youtu.be/v3CeZ9TaAWo?t=383
#+begin_src emacs-lisp :tangle ide.el
(use-package scimax-literate-programming
  :quelpa (scimax-literate-programming
           :fetcher url
	   :url "https://raw.githubusercontent.com/jkitchin/scimax/master/scimax-literate-programming.el")
  :ensure nil
  :config
  (add-to-list 'scimax-lp-etags-language-map
               '("js2" . "javascript"))
  ;;I will manually regenerate the TAGS file:-
  ;;(setq scimax-lp-update-tags-always nil)
  ;;^Theres a bug, it needs to be true for even the manual tag generation to succeed.
  )
#+end_src

*** COMMENT anoop's simplest TAGS generator for literate org js blocks
Run universal-ctags on a stripped version of the ORG-FILE in LANG mode.
This should run universal-ctags on a version of the org-file where all
content that is not a src-block in LANG that is supposed to be
tangled has been stripped out. This is done dangerously; the
current buffer is erased and replaced with the stripped content
so that universal-ctags believes it is the right file, then the content is
replaced back. This is done inside an `atomic-change-group' which
should make this a safe operation.
#+begin_src emacs-lisp :tangle ide.el
(defun scimax-lp-update-lang-tags (org-file)
  (message "Updating javascript tags in %s" org-file)
  (with-current-buffer (find-file-noselect org-file)
    (save-buffer)

    (let* ((content-bak (buffer-string)))
      ;; This has potential for disaster since it deletes the buffer! I think
      ;; this is pretty safe, but you should be prepared for disaster. If
      ;; there is any error in this, I think it undoes the buffer damage.
      (atomic-change-group
        <<Strip prose from this org buffer>>
        <<Execute universal-ctags>>
        ;; now restore the orgfile to include both prose and code
        (erase-buffer)
        (insert content-bak)
        (save-buffer)))))
#+end_src

I will be using universal-ctags, because it is a maintained fork of ctags & it supports javascript language
#+begin_src emacs-lisp :noweb-ref "Execute universal-ctags"
(shell-command (format "/usr/bin/ctags --output-format=etags --language-force=javascript %s" org-file))
#+end_src

The following procedures removes all prose from an org buffer.
Only javascript code is retained in the org file, at their original line numbers.
After this operation, the org file is a valid javascript file.
#+begin_src emacs-lisp :noweb-ref "Strip prose from this org buffer"
(goto-char (point-min))
(while (and (not (eobp)))
  (if (and (org-in-src-block-p)
	   (string= "js2" (car (org-babel-get-src-block-info 'light)))
	   )
      (let* ((src (org-element-context))
	     (end (org-element-property :end src))
	     (len (length (buffer-substring
			   (line-beginning-position)
			   (line-end-position))))
	     newend)
	(setf (buffer-substring
	       (line-beginning-position)
	       (line-end-position))
	      "")
	;; Now skip to end, and go back to then src delimiter and
	;; eliminate that line.
	(goto-char (- end len))
	(forward-line (- (* -1 (org-element-property :post-blank src)) 1))
	(setf (buffer-substring
	       (line-beginning-position)
	       (line-end-position)) ""))
    (setf (buffer-substring
	   (line-beginning-position)
	   (line-end-position)) ""))
  (forward-line 1))
(save-buffer)
#+end_src

Lets create a simple and memorable =M-x= UI for the above function
This function generate a TAGS file for all js source blocks in the input org file. It also loads the generate TAGS for xref usage.
In other words, you just call this function to enable =M-.= and =M-,= during literate programming using javascript+orgmode.
#+begin_src emacs-lisp :tangle ide.el
(defun js-tags-activate0 ()
  "Generate TAGS file, tell xref to use this new TAGS file."
  (interactive)
  (when (eq major-mode 'org-mode)
    (save-buffer)
    (let ((current-point (point)))
      (scimax-lp-update-lang-tags (buffer-file-name))
      (goto-char current-point)))
  (visit-tags-table (format "%sTAGS" (file-name-directory (buffer-file-name)))
                    'only-locally))
#+end_src

#+begin_src emacs-lisp :tangle ide.el
(defun test ()
  (interactive)
  (message (buffer-file-name)))
#+end_src

I disabled this over a simpler version where no stripping of prose is done on the org buffer.

** Go to definition using dumb-jump - uses ripgrep internally
*** xref must use vertico
Tell xref to use the vertico + consult interface
Use Consult to select xref locations with preview
#+begin_src emacs-lisp :tangle ide.el
(setq xref-show-xrefs-function #'consult-xref
      xref-show-definitions-function #'consult-xref)
#+end_src

*** install dumb-jump
This works without the need for any TAGS file.
It uses xref as its frontend. ie, it acts as a backend to xref interface.
#+begin_src emacs-lisp :tangle ide.el
(use-package dumb-jump
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (setq dumb-jump-force-searcher 'ag)
  <<dumb-jump config>>)
#+end_src

**** ag
I found ag respects .dumbjump file more strictly. I love this feature. Also, ag seems like the preferred tool by dumbjump author.
**** CANCELLED rg
I had to build ripgrep myself.
#+begin_quote
PCRE2 is not available in this build of ripgrep [apt install ripgrep].
#+end_quote
#+begin_quote https://github.com/BurntSushi/ripgrep?tab=readme-ov-file#installation
Finally, optional PCRE2 support can be built with ripgrep by enabling the pcre2 feature:
$ cd ~/Documents/ripgrep && cargo install --features 'pcre2' --path .
#+end_quote

**** not working in app1.org file
Dumbjump added support for org babel source blocks. But, I dont like their implementation.

I would rather force it to treat org files similar to clojure files. This ensures that dumbjump works well on app1.org.
Hence, disable their org babel support.

#+begin_src emacs-lisp :noweb-ref "dumb-jump config"
(defun dumb-jump-get-language-in-org ()
  "In org mode, always lie to dumbjump machine that you are NOT inside any src block"
  "org")
#+end_src
~(setq dumb-jump-debug t)~ is super useful in debugging issues.

*** Also use clojure definitions when dumb-jumping inside org files
**** COMMENT try1
Ask it to treat org files using the same regexes its uses for clojure files. As a result, this setup has a limitation. It works only for org babel clojure blocks.
#+begin_src emacs-lisp :noweb-ref "dumb-jump config"
(add-to-list 'dumb-jump-language-file-exts '(:language "clojure" :ext "org" :agtype "clojure" :rgtype "clojure"))
#+end_src
^If I could use the org babel language header to dynamically set the value of ~dumb-jump-language-file-exts~, then this can work for any org-babel block.
This PR might fix this problem soon [[https://github.com/jacktasia/dumb-jump/pull/411][gh pr]]

Above did not work reliably for some reason. Since try2 succeeded, I gave up this approach

**** try2
Add Clojure rules to Org mode in Dumb Jump. Idea stolen from [[https://github.com/jacktasia/dumb-jump/issues/441][org-babel Support? · Issue #441 · jacktasia/dumb-jump]]
#+begin_src emacs-lisp :noweb-ref "dumb-jump config"
(let ((clojure-rules (cl-remove-if-not (lambda (rule)
                                          (string= (plist-get rule :language) "clojure"))
                                        dumb-jump-find-rules)))
    (setq dumb-jump-find-rules
          (append dumb-jump-find-rules
                  (mapcar (lambda (rule)
                            (plist-put (copy-tree rule) :language "org"))
                          clojure-rules))))
#+end_src

dumb-jump doesnt have any prebuilt rule for clojurescript. Need to fix that first

Since cljs uses the same syntax as clj, I do not need to seperately add the above mod for cljs. The clj regex will work just as well for cljs.
Because, I am adding rules for org file, not a cljs file. A clj rule will also search cljs definitions in the org file.

*** Intelligently route /go to definition/ according to where it is called from
If in src block header, call /go to literate definition/,
if not, call /go to dumbjump definition/
#+begin_src emacs-lisp :tangle ide.el
(defun anoop/routed/goto ()
  (interactive)

  ;;push current location to xref history stack, so that xref-go-back use it to come back
  (xref-push-marker-stack)
  
  (cond ((anup/looking-at-literate-usage?) (call-interactively 'anup/goto-definition))
        ((anup/looking-at-literate-definition?) (call-interactively 'anup/goto-usage))
        (t (call-interactively 'xref-find-definitions))))
#+end_src
^Dumb-jump uses xref as its interface. Hence, the keybindings continue to point to xref. ie, the default case of cond indirectly calls dumb-jump.

Keybind them
#+begin_src emacs-lisp :noweb-ref "From/Literate Programming. To/org/org-mode-map/bind_star"
("M-." . anoop/routed/goto)
("M-," . xref-go-back)
#+end_src

Someday, I might make dumb-jump completely replace ~anup/looking-at-...~ functions. [[https://github.com/jacktasia/dumb-jump/issues/453][Support org src named blocks · Issue #453 · jacktasia/dumb-jump]]

** literate shell scripting
Currently, ob-shell & ob-bash doesnt respect my .bashrc
Currently, I dont trust exec-path-from-shell.el package, because I vaguely recall it causing me problems in the past.

Therefore, I will trick bash into loading my .bashrc my telling it to always execute ob-shell code interactively.
Interactive shells always load the .bashrc
Update:- This causes some trouble when I C-c C-c, so I disable this buggy solution.
#+begin_src emacs-lisp :tangle ide.el
;;+(setq shell-command-switch "-ic")+
#+end_src

Alternate solution,
Load the .bashrc by specifying an appropriate ENV variable
#+begin_src emacs-lisp :tangle ide.el
(setenv "BASH_ENV" (expand-file-name "~/.bashrc"))
#+end_src

Load aliases defined in .bashrc even for non-login non-interactive shells. For this you need to add the following to your bashrc.
#+begin_src bash
shopt -s expand_aliases
#+end_src
** Sticky the current org heading as the topmost line of the buffer
Its available on melpa
#+begin_src emacs-lisp :tangle ide.el
(use-package org-sticky-header
  :hook
  ((org-mode . org-sticky-header-mode))
  :config
  <<Patched definition of org-sticky-header--fetch-stickyline>>
  (setq org-sticky-header-full-path 'reversed)
  <<org-sticky-header/config>>)
#+end_src

Below will fix the problem of the heading being show twice sometimes.
#+begin_src emacs-lisp :noweb-ref "org-sticky-header/config"
(setq org-sticky-header-always-show-header nil)
#+end_src

Someday, I would like to customize the theme of the sticky line, so that it will never be confused with the orgmode's own headings. [[https://github.com/alphapapa/org-sticky-header/issues/25][hints on how to do this]]

Below will further help in differentiating the sticky line from a normal editable buffer line. A wierd untypable character (such as 🫲⏪◀🠈🢨🠜🢀) in that line will make my brain notice that this line is autogenerated, and not typed out.
#+begin_src emacs-lisp :noweb-ref "org-sticky-header/config"
(setq org-sticky-header-outline-path-reversed-separator " ⏪ ")
#+end_src
Ended up picking the orange one because it stands out the most amongst typed out text.

Please dont show those ugly org asterisks
#+begin_src emacs-lisp :noweb-ref "org-sticky-header/config"
(setq org-sticky-header-heading-star " ")
#+end_src

BTW, clicking on the sticky line will take you to that heading. ie, equivalent functionality as =C-c C-p=

