ide.el

(setq xref-show-xrefs-function #'consult-xref
      xref-show-definitions-function #'consult-xref)

(use-package dumb-jump
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (setq dumb-jump-force-searcher 'ag)
  (defun dumb-jump-get-language-in-org ()
  "In org mode, always lie to dumbjump machine that you are NOT inside any src block"
  "org")
(let ((clojure-rules (cl-remove-if-not (lambda (rule)
                                          (string= (plist-get rule :language) "clojure"))
                                        dumb-jump-find-rules)))
    (setq dumb-jump-find-rules
          (append dumb-jump-find-rules
                  (mapcar (lambda (rule)
                            (plist-put (copy-tree rule) :language "org"))
                          clojure-rules)))))

(defun anoop/routed/goto ()
  (interactive)

  ;;push current location to xref history stack, so that xref-go-back use it to come back
  (xref-push-marker-stack)
  
  (cond ((anup/looking-at-literate-usage?) (call-interactively 'anup/goto-definition))
        ((anup/looking-at-literate-definition?) (call-interactively 'anup/goto-usage))
        (t (call-interactively 'xref-find-definitions))))

;;+(setq shell-command-switch "-ic")+

(setenv "BASH_ENV" (expand-file-name "~/.bashrc"))

(use-package org-sticky-header
  :hook
  ((org-mode . org-sticky-header-mode))
  :config
